#创建列表，，依次比较相邻的数，和规则相反的数据交换，直到最后一个元素，中间某次交换为0次则终止循环
'''
循环查看n-1 和n 数值大小，如果n-1的值比n的值大，就交换两个的值
从下标为1的位置开始循环
当某次循环没有任何交换，说明已经排序完成，终止循环
'''
#         0  1  2  3  4  5  6  7
list1 = [30,13,25,16,47,26,19,10]
#list1 = [62,3,8,1,4,45,32,7]
#从小到大排序,

#print(len(list1))
print('原始状态：',list1)
for i in range(len(list1) - 1) :
    j = 0 #每次循环定义j变量保存此次循环交换的次数，
    for n in range(1,len(list1) - i) :
        if list1[n - 1] > list1[n] :
            list1[n - 1],list1[n] = list1[n],list1[n - 1]
            j += 1
        #print(list1[n])
    if j == 0 : #当循环后交换次数是0时则说明已经排序完成，终止循环
        break
    print('遍历%d次以后：'%(i + 1),list1)
'''
循环len(list1) - 1 次就够了
原始状态：    [30, 13, 25, 16, 47, 26, 19, 10]
遍历1次以后： [13, 25, 16, 30, 26, 19, 10, 47]
遍历2次以后： [13, 16, 25, 26, 19, 10, 30, 47]
遍历3次以后： [13, 16, 25, 19, 10, 26, 30, 47]
遍历4次以后： [13, 16, 19, 10, 25, 26, 30, 47]
遍历5次以后： [13, 16, 10, 19, 25, 26, 30, 47]
遍历6次以后： [13, 10, 16, 19, 25, 26, 30, 47]
遍历7次以后： [10, 13, 16, 19, 25, 26, 30, 47]
'''










